# Consultas SQL

Neste capítulo utilizaremos extensivamente a instrução <code>SELECT</code> para realizar consultas no banco de dados criado no capítulo anterior.

## Estrutura básica

In [1]:
# Setup
import shutil

shutil.copyfile('../02/ecom.db', 'ecom.db')

'ecom.db'

In [2]:
%load_ext sql
%sql sqlite:///ecom.db

A instrução <code>SELECT</code> é utilizada para realizar consultas no banco de dados. Por exemplo, para consultar todos os registros da tabela **tb_cliente**, utilizamos a seguinte instrução:

In [3]:
%%sql

SELECT *
FROM tb_cliente

 * sqlite:///ecom.db
Done.

[(1, 'Noel Rosa', 'noelrosa@gmail.com', '1910-12-11'),
 (2, 'Clara Nunes', 'claranunes@yahoo.com', '1942-08-12'),
 (3, 'Clementina de Jesus', 'clementinadejesus@yahoo.com', '1901-02-07'),
 (4, 'Angenor de Oliveira Cartola', 'cartola@gmail.com', '1908-10-11')]

Observe que a estrutura da consulta pode ser interpretada como uma instrução para o SGBD: 

*Selecione (SELECT) todas as colunas (\*) da tabela (FROM) tb_cliente.*

Nem sempre precisamos de todas as colunas na nossa consulta. Por exemplo, para selecionar somente as colunas **cd_cliente** e **nm_cliente**:

In [4]:
%%sql

SELECT cd_cliente, nm_cliente
FROM tb_cliente

 * sqlite:///ecom.db
Done.

[(1, 'Noel Rosa'),
 (2, 'Clara Nunes'),
 (3, 'Clementina de Jesus'),
 (4, 'Angenor de Oliveira Cartola')]

A instrução pode ser lida da seguinte forma:

*Selecione (SELECT) as colunas cd_cliente e nm_cliente da tabela (FROM) tb_cliente.*

Assim como podemos limitar as colunas da consulta, também podemos limitar a quantidade de registros. Por exemplo, para selecionar somente clientes com data de nascimento a partir de 1910:

In [5]:
%%sql

SELECT *
FROM tb_cliente 
WHERE dt_nascimento >= '1910-01-01'

 * sqlite:///ecom.db
Done.

[(1, 'Noel Rosa', 'noelrosa@gmail.com', '1910-12-11'),
 (2, 'Clara Nunes', 'claranunes@yahoo.com', '1942-08-12')]

Perceba que a instrução pode ser lida da seguinte forma:

*Selecione (SELECT) todas as colunas (\*) da tabela (FROM) tb_cliente, mas somente registros onde (WHERE) a data de nascimento seja maior ou igual a 01/01/1910.*

## Condições

Por meio da cláusula <code>WHERE</code> podemos definir condições para selecionar um subconjunto de registros. Vamos ver alguns exemplos.

Para selecionar clientes com data de nascimento entre 11/10/1908 e 31/12/1940:

In [6]:
%%sql

SELECT *
FROM tb_cliente
WHERE dt_nascimento >= '1908-10-11' AND dt_nascimento <= '1940-12-31'

 * sqlite:///ecom.db
Done.

[(1, 'Noel Rosa', 'noelrosa@gmail.com', '1910-12-11'),
 (4, 'Angenor de Oliveira Cartola', 'cartola@gmail.com', '1908-10-11')]

Observe que foi usado apenas o operador <code>AND</code> para estruturar a condição. Mas existe uma maneira de simplificar esta condição, utilizando a cláusula <code>BETWEEN</code>.

In [7]:
%%sql

SELECT *
FROM tb_cliente
WHERE dt_nascimento BETWEEN '1908-10-11' AND '1940-12-31'

 * sqlite:///ecom.db
Done.

[(1, 'Noel Rosa', 'noelrosa@gmail.com', '1910-12-11'),
 (4, 'Angenor de Oliveira Cartola', 'cartola@gmail.com', '1908-10-11')]

Selecionando o nome dos clientes com data de nascimento entre 11/10/1908 e 31/12/1940:

 * sqlite:///ecom.db
Done.

[('Noel Rosa',), ('Angenor de Oliveira Cartola',)]

In [8]:
%%sql

SELECT 
    nm_cliente
FROM tb_cliente
WHERE dt_nascimento BETWEEN '1908-10-11' AND '1940-12-31'

 * sqlite:///ecom.db
Done.

[('Noel Rosa',), ('Angenor de Oliveira Cartola',)]

Selecionando o nome dos clientes que nasceram antes de 01/01/1908 ou depois de 31/12/1910:

In [9]:
%%sql

SELECT 
    nm_cliente
FROM tb_cliente
WHERE dt_nascimento < '1908-01-01'
 OR dt_nascimento > '1910-12-31'

 * sqlite:///ecom.db
Done.

[('Clara Nunes',), ('Clementina de Jesus',)]

Selecionando os clientes com código 1, 2 ou 4.

In [10]:
%%sql

SELECT 
    *
FROM tb_cliente
WHERE cd_cliente = 1
    OR cd_cliente = 2
    OR cd_cliente = 4

 * sqlite:///ecom.db
Done.

[(1, 'Noel Rosa', 'noelrosa@gmail.com', '1910-12-11'),
 (2, 'Clara Nunes', 'claranunes@yahoo.com', '1942-08-12'),
 (4, 'Angenor de Oliveira Cartola', 'cartola@gmail.com', '1908-10-11')]

In [11]:
%%sql

SELECT 
    *
FROM tb_cliente
WHERE cd_cliente IN (1,2,4)

 * sqlite:///ecom.db
Done.

[(1, 'Noel Rosa', 'noelrosa@gmail.com', '1910-12-11'),
 (2, 'Clara Nunes', 'claranunes@yahoo.com', '1942-08-12'),
 (4, 'Angenor de Oliveira Cartola', 'cartola@gmail.com', '1908-10-11')]